<template>
    <div>
        <h2>Знакомство с ассетами</h2>
        <hr>
        <div class="first-section">
            <p>Перед началом этого модуля предупрежу, что здесь будет меньше разъяснений про скрипт, потому что хотелось
                чтобы вы сами изучили документацию, я буду ее давать ниже кода для ознакомления. Итак начнем!</p>
            <p>В этом модуле, я бы хотел воссоздать какую-то механику с машинами, чтобы у вас уже было понимание, как и
                что происходит</p>
            <ol>
                <li>
                    <p>
                        Для начала скачаем ассеты, можете использовать свои или снизу ссылка на скачивания
                        с официального сайта или гугл диск с готовым
                        <a href="https://docs.unity3d.com/Manual/AssetPackages.html" target="_blank">Unity package</a>
                        на машинки
                    </p>
                </li>
                <p class="info-tip">ℹ️ Если прям уж крутые 😎 сделайте свои в блендере и др.</p>
                <h3>Официальная ссылка на Unity Asset Store</h3>
                <a href="https://assetstore.unity.com/packages/3d/vehicles/land/arcade-free-racing-car-161085"
                    target="_blank">
                    Машинки + дорога
                </a>
                <h3>Ссылка на Unity package</h3>
                <a href="https://drive.google.com/file/d/1LLaVDFnSonCq9RSx-oNUq_juUbgND7FG/view">Unity package</a>
                <li>
                    <div class="download-section">
                        <p>Если вы скачали ассет со своего аккаунта, тогда переходите в редактор Unity и
                            у нас будет примерно такой распорядок действий: Asset Store ➔ Package Manager ➔
                            ARCADE:FREE Racing Car ➔ Import to project ➔ Import. </p>
                        <img src="/images/fourth/my-assets.webp" alt="my-assets">
                        <hr>
                        <div class="unitypackage-wrapper">
                            <div class="unitypackage-import">
                                <img src="/images/fourth/google-import.webp" alt="google-import">
                                <p>
                                    Второй вариант был с гугла будет выглядеть примерно, так: Assets ➔ Import Package ➔
                                    Custom Package...
                                    <br>
                                    Далее выберите файл, который скачали
                                </p>
                            </div>
                        </div>
                    </div>
                </li>
                <li>
                    <p>Перейдем сразу к готовой сцене, которая у нас была в этом пекейдже</p>
                    <img src="/images/fourth/scene.webp" alt="">
                </li>
                <li>
                    <p>У вас все будет фиолетовое, сейчас нам надо будет наложить на них текстурки, материалы. Зайдите в
                        объект
                        <b>Road</b>, нужно в материале поменять <b>Shader</b> выбираем <b>URP/Lit</b>. Далее
                        перетаскиваем текстурку на сущность.
                        Теперь у нас есть раскрашенная дорога, йоу.
                    </p>
                    <img src="/images/fourth/shader-choose.webp" alt="">
                    <hr>
                    <p>Сейчас надо наложить текстурки на машину. Нам не нужны все машины, пока что оставьте один объект
                        машины. <br>
                        Раскройте Cars ➔ Перетащите любую ➔ Удалите остальные
                    </p>
                    <p>
                        После этого раскройте объект, который оставили, чтобы задать текстурку машине, следуйте
                        инструкции снизу:
                    <ul>
                        <li>Body ➔ Shader ➔ URP/Lit</li>
                        <li>Spoiler ➔ Shader ➔ URP/Lit</li>
                        <li>Material ➔ Main Maps ➔ Albedo ➔ Выбираем интересующий цвет</li>
                        <li>Material ➔ Surface Options ➔ Base Map ➔ Выбираем интересующий цвет</li>
                    </ul>
                    </p>
                    <h4>Пример выполнения, выглядит так</h4>
                    <img src="/gifs/fourth/car-material.gif" alt="car-gif">
                    <h4>Результат всего этого, с вашим цветом будет такой:</h4>
                    <img src="/images/fourth/car-material.webp" alt="material-car">
                </li>
            </ol>
            <hr>
            <div class="task-title">
                <h4 style="background: #1E293B; border-radius: 8px; padding: .4rem; color: aliceblue;">🚨 ЗАДАНИЕ 🚨</h4>
                
                <ol style="max-width: 800px;">
                    <li><p>Расширьте поле, по которому будет кататься ваша <b>машина</b>.</p></li>
                    <li><p>Переместите камеру так, чтобы камера над машиной была от 3го лица.</p></li>
                    <li><p>Вложите саму камеру в "Машину". Надо, чтобы камера была вложена в объект</p></li>
                    <li><p>Зайдите в: Package ➔ Materials ➔ Color Variations. Перекрасьте все материалы в разные цвета</p></li>
                    <li><p>Возьмите <b>НОВУЮ</b> Модель машины из папки: Package ➔ Meshes ➔ Модель машины. Поставьте <b>ОДНУ</b> машину напротив нашей основной модели (Желтой тачки).</p></li>
                    <div style="background:#FEEFC3 ; border-radius: 8px; padding: .4rem; color: #1E293B;">
                        ⚠️ Предупреждение! Если скопируйте и вставите тот же объект машины, которая сделана в будущем все сломается.
                    </div>
                    <li><p>Примените один из материалов на созданную машину</p></li>
                </ol>
                
                <div class="special-tip-for-task">
                    <p><b>✏️ Подсказка #1</b> — Если забыли везде, Lit в шейдерах у материалов</p>
                </div>
                <div class="special-tip-for-task">
                    <p><b>🖌️ Подсказка #2</b> — Preview камеры видно в секции Game</p>
                </div>
                <div class="special-tip-for-task">
                    <p><b>🖌️ Подсказка #3</b> — Откройте саму сущность машины и примените на каждый объект материал, который вы сделали</p>
                </div>
            </div>  
            <h4>Теперь сравните результат с моим</h4>
            <img src="/images/fourth/task-complete1.webp" alt="task-complete1">
            <img src="/images/fourth/task-complete2.webp" alt="task-complete2">
            <div style="display: flex; justify-content: center;">
                <p style="max-width: 1000px;">Если все получилось, можем уже начинать прорабатывать механику машины и окружение вокруг нее. Приступим к следующему модулю!</p>
            </div>
        </div>
    </div>
</template>
<script>
</script>
<style scoped lang="sass">
@import "@/assets/styles/pages/second/first-task.sass"    
</style>