[
    {
      "title": "Всем привет студентики!",
      "content": "<h3>👋Добро пожаловать, в мой туториал по Unity! 🕹️ </h3> 😅 Не думайте, что вы станете величайшими разработчиками по прохождению этого мини туториала, но я вас уверяю — это поможет вам начать свой путь гейм-дизайнера 🎮✨ <br><br>🧭 Так вот, чуть про интерфейс, чтобы было понятнее куда нажимать:\n<b>слева сверху</b> — меню-сайдбар ☰, который позволяет быстро перемещаться по страницам 📚 <br> <br> 🫠 Следующее раздел находится <b>сверху справа</b> тут у нас полезные кнопки помогут вам при изучении <br> <br> 😜 <b>1.</b> Главная - просто перемещает вас на главную страницу <br> <br>😁 <b>2.</b> Ссылки - раздел, где вы сможете найти больше полезных сайтов по изучению Unity, если захотите продолжить свой путь <br> <br> 😋 <b>3. </b> Что такое?<p class='main-page-conclusion'>Ну еще из главного можно подметить, что юнити 🛠️ это не какой-то крутой и прям жутко зависимый инструмент в вашем арсенале 💻. В первую очередь это просто скрипты , которые вы пишите и если скрипт не требует от себя заумностей 🤔, не замедряйте процесс кодинга ⏳. <br> Так вот картинка снизу, представленная в виде дерева ваших скриптов 🌳, так вот если компонент нигде больше не используется ❌ не тратьте время на его супер крутую реализацию, возможно простая реализация будет круче заумной 😎. <br>Если все-таки меня не поняли 🤷‍♂️, думаю в будущем поймете🔮. Тогда ваша инди-душа разработчика ✨ возможно чего-то добьется 🎯<br> </p><div class='main-page-img'><img src='/images/unity.webp'/></div>",
      "page": 0
    },
    {
      "title": "Глава 1.1",
      "content": "<h3>🚀 Начало пути</h3><hr><div class='first-task-container'> <p><b>1.</b> 🧩 Перед тем как начать, нужно скачать сам Unity, это можно сделать по <a href='https://unity.com/download' target='_blank'>ссылке</a>, после скачивания приступаем к другому пункту</p><img src='/images/first/download.webp' alt='download' /> <p><b>2.</b>✅ Почти готово! После установки ищем 'Unity Hub' и запускаем. Осталось лишь войти в аккаунт и скачать сам движок Unity, приступим! Если аккаунта не было, создайте его <br></p><img src='/images/first/sign-in.webp' alt='sign-in' /> <p><b>3.</b>📦 После входа в ваш аккаунт нас интересует 'Installs' здесь нам надо установить движок, нажимаем на 'Install Editor', где выбираем версию Unity 6 LTS(Long time support)</p><img src='/images/first/download-unity-core.webp' alt='download-unity-core.webp'/><img src='/images/first/choose-lts.webp' alt='create-project'/> <p><b>4.</b>🎨 Такс, разобрались с движком, теперь осталось создать проект в которым вы уже будете творить магию, нажимаем на кнопку 'New project'. Здесь мы выбираем Univesal 3D, задаем удобные вам параметры и создаем проект 'Create project'</p><img src='/images/first/create-project.webp'/> <p>📚 В целом заданий нет доп. заданий можете показать результат преподавателю, если он конечно вообще будет проверять, да и все:)</p> <p>🎊 Ура! В этом мини модуле вы научились создавать Unity проект. Дальше мы научимся основному инструментарию юнити -> Если у вас все получилось можете переходить к следующему таску.</p></div>",
      "page": 1
    },
    {
      "title": "Глава 1.2",
      "content": "<h3> Окружение Unity</h3><hr><div class='second-task-container'><p>Для начало взгляните на скрин, представленный снизу. Да, понимаю ничего не понятно, но сейчас все объясню. У вас есть окружение в Unity с которым вы будете работать. Так вот, есть 5 основных секций: <ol><li>Hierarchy - Иерархия</li><li>Project - Проект</li><li>Scene - Сцена</li><li>Game - Превью игры</li><li>Inspect - Свойство объекта</li></ol></p><img src='/images/second/project.webp' alt='project-pic' /> <div class='first-section'><div class='section-item'><img src='/images/second/hierarchy.webp' alt='hierarchy-pic' /><p><b>1.</b><b> Hierarchy</b>, в этой секции у нас будут храниться все ваши объекты вашего проекта на конкретной сцене, а также по нажатию ПКМ можно в дальнейшем создать одну из сущностей вашей игры.</p></div><div class='section-item'><img src='/images/second/inspector.webp' alt='inspector-pic' /><p><b>2.</b><b> Inspector</b>, в этой секции у нас отображаются все свойства объекта, на который вы нажали, сами сущности создаются как раз таки в иерархии, так вот тут вы можете настроить свою деталь так как нужно</p></div> </div></div>",
      "page": 2
    },
    {
      "title": "Глава 1",
      "content": "Спасибо за прочтение!",
      "page": 3
    },
    {
      "title": "Глава 2",
      "content": "Спасибо за прочтение!",
      "page": 4
    }
]
  