<template>
    <div>
    <h2>👋Добро пожаловать, в мой туториал по Unity! 🕹️</h2>
    😅 Не думайте, что вы станете величайшими разработчиками по прохождению этого мини туториала, но я вас уверяю — это поможет вам начать свой путь гейм-дизайнера 🎮✨ <br />
    <br />
    🧭 Так вот, чуть про интерфейс, чтобы было понятнее куда нажимать <b>слева сверху</b> — меню-сайдбар ☰, который позволяет быстро перемещаться по страницам 📚 <br />
    <br />
    🫠 Следующее раздел находится <b>сверху справа</b> тут у нас полезные кнопки помогут вам при изучении <br />
    <br />
    😜 <b>1.</b> Главная - просто перемещает вас на главную страницу <br />
    <br />
    😁 <b>2.</b> Ссылки - раздел, где вы сможете найти больше полезных сайтов по изучению Unity, если захотите продолжить свой путь <br />
    <br />
    😋 <b>3. </b> Туториал - сообственно сам туториал
    <p class="main-page-conclusion">
        Ну еще из главного можно подметить, что юнити 🛠️ это не какой-то крутой и прям жутко зависимый инструмент в вашем арсенале 💻. В первую очередь это просто скрипты , которые вы пишите и если скрипт не требует от себя заумностей 🤔,
        не замедряйте процесс кодинга ⏳. <br />
        Так вот картинка снизу, представлена в виде дерева ваших скриптов 🌳, так вот если компонент нигде больше не используется ❌ не тратьте время на его супер крутую реализацию, возможно простая реализация будет круче заумной 😎. <br />
        Если все-таки меня не поняли 🤷‍♂️, думаю в будущем поймете🔮. Тогда ваша инди-душа разработчика ✨ возможно чего-то добьется 🎯<br />
    </p>
    <div class="main-page-img"><img src="/images/unity.webp" /></div>
</div>
</template>
<script>

</script>
<style scoped lang="">

</style>